trezor/trezor-firmware/core/embed/sdk/nrf52/examples/crypto/nrf_crypto/test_app/test_cases/test_vectors_aes_ecb.c
/**
 * Copyright (c) 2018 - 2021, Nordic Semiconductor ASA
 *
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 *    list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 */

#include <stdio.h>
#include <stdarg.h>
#include <string.h>
#include <stddef.h>
#include "nrf_gpio.h"
#include "nrf_delay.h"
#include "nrf_error.h"
#include "app_util.h"
#include "nrf_section.h"
#include "nrf_crypto.h"
#include "common_test.h"

/**@brief ECB test vectors can be found on NIST web pages.
 *
 * https://csrc.nist.gov/projects/cryptographic-algorithm-validation-program/block-ciphers#AES
 */

#if NRF_MODULE_ENABLED(NRF_CRYPTO_AES_ECB)

/*lint -save -e91 */

#if NRF_MODULE_ENABLED(NRF_CRYPTO_AES_ECB_128)

// AES ECB - Functional test using test vector NIST CAVS 11.1 ECB KeySbox 128 - Count 0
NRF_SECTION_ITEM_REGISTER(test_vector_aes_func_data, test_vector_aes_t test_vector_aes_ecb_128_functional) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ecb_128_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "ECB 128 Functional",
    .p_plaintext        = "00000000000000000000000000000000",
    .p_ciphertext       = "6d251e6944b051e04eaa6fb4dbf78465",
    .p_key              = "10a58869d74be5a374cf867cfb473859"
};

// AES ECB - Custom test vector - Encrypt - Message length 0
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_ecb_128_encrypt_c0) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ecb_128_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "ECB 128 Encrypt message_len=0",
    .p_plaintext        = "",
    .p_ciphertext       = "",
    .p_key              = "89df4c819f49dbcbcb124304023cf38c"
};

// AES ECB - Custom test vector - Decrypt - Message length 0
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_ecb_128_decrypt_c0) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ecb_128_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "ECB 128 Decrypt message_len=0",
    .p_plaintext        = "",
    .p_ciphertext       = "",
    .p_key              = "89df4c819f49dbcbcb124304023cf38c"
};

// AES ECB - Custom test vector - Encrypt - pkcs7-padding
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_ecb_128_encrypt_c3) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ecb_128_pad_pkcs7_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "ECB 128 Encrypt message_len=1 pkcs7-padding",
    .p_plaintext        = "de",
    .p_ciphertext       = "77914f065bdaccd3ca428385e4f20643",
    .p_key              = "89df4c819f49dbcbcb124304023cf38c"
};

// AES ECB - Custom test vector - Decrypt - pkcs7-padding
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_ecb_128_decrypt_c3) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ecb_128_pad_pkcs7_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "ECB 128 Decrypt message_len=1 pkcs7-padding",
    .p_plaintext        = "de0f0f0f0f0f0f0f0f0f0f0f0f0f0f0f",                                       /**< The 15 padded bytes (0x0f) will be removed in the actual generated plaintext. */
    .p_ciphertext       = "77914f065bdaccd3ca428385e4f20643",
    .p_key              = "89df4c819f49dbcbcb124304023cf38c"
};

// AES ECB - Custom test vector - Encrypt - pkcs7-padding
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_ecb_128_encrypt_c4) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ecb_128_pad_pkcs7_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "ECB 128 Encrypt message_len=16 pkcs7-padding",
    .p_plaintext        = "dededededededededededededededede",
    .p_ciphertext       = "012e6cf02e5746a4ae7ad6287e244973a87e6dbf88ffd1413b95b96491c8872a",
    .p_key              = "89df4c819f49dbcbcb124304023cf38c"
};

// AES ECB - Custom test vector - Decrypt - pkcs7-padding
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_ecb_128_decrypt_c4) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ecb_128_pad_pkcs7_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "ECB 128 Decrypt message_len=16 pkcs7-padding",
    .p_plaintext        = "dededededededededededededededede10101010101010101010101010101010",       /**< The 16 padded bytes (0x10) will be removed in the actual generated plaintext. */
    .p_ciphertext       = "012e6cf02e5746a4ae7ad6287e244973a87e6dbf88ffd1413b95b96491c8872a",
    .p_key              = "89df4c819f49dbcbcb124304023cf38c"
};

// AES ECB - Custom test vector - Encrypt - pkcs7-padding
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_ecb_128_encrypt_c5) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ecb_128_pad_pkcs7_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "ECB 128 Encrypt message_len=31 pkcs7-padding",
    .p_plaintext        = "dedededededededededededededededededededededededededededededede",
    .p_ciphertext       = "012e6cf02e5746a4ae7ad6287e244973e0dcca6023766f779fd984c5c321c7ee",
    .p_key              = "89df4c819f49dbcbcb124304023cf38c"
};

// AES ECB - Custom test vector - Decrypt - pkcs7-padding
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_ecb_128_decrypt_c5) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ecb_128_pad_pkcs7_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "ECB 128 Decrypt message_len=31 pkcs7-padding",
    .p_plaintext        = "dedededededededededededededededededededededededededededededede01",       /**< The padded byte (0x01) will be removed in the actual generated plaintext. */
    .p_ciphertext       = "012e6cf02e5746a4ae7ad6287e244973e0dcca6023766f779fd984c5c321c7ee",
    .p_key              = "89df4c819f49dbcbcb124304023cf38c"
};

// AES ECB - NIST CAVS 11.1 GFSBox Tests 128 Encrypt - Count 0
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_ecb_128_encrypt_gfsb0) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ecb_128_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "ECB 128 Encrypt GFSBox 0",
    .p_plaintext        = "f34481ec3cc627bacd5dc3fb08f273e6",
    .p_ciphertext       = "0336763e966d92595a567cc9ce537f5e",
    .p_key              = "00000000000000000000000000000000"
};

