trezor/trezor-firmware/core/embed/sdk/nrf52/examples/crypto/nrf_crypto/test_app/test_cases/test_vectors_aes_ecb.c
// AES ECB - NIST CAVS 11.1 GFSBox Tests 128 Decrypt - Count 0
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_ecb_128_decrypt_gfsb0) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ecb_128_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "ECB 128 Decrypt GFSBox 0",
    .p_plaintext        = "f34481ec3cc627bacd5dc3fb08f273e6",
    .p_ciphertext       = "0336763e966d92595a567cc9ce537f5e",
    .p_key              = "00000000000000000000000000000000"
};

// AES ECB - NIST CAVS 11.1 VarKey Tests 128 Encrypt - Count 0
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_ecb_128_encrypt_vk0) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ecb_128_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "ECB 128 Encrypt VarKey 0",
    .p_plaintext        = "00000000000000000000000000000000",
    .p_ciphertext       = "0edd33d3c621e546455bd8ba1418bec8",
    .p_key              = "80000000000000000000000000000000"
};

// AES ECB - NIST CAVS 11.1 VarKey Tests 128 Encrypt - Count 127
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_ecb_128_encrypt_vk127) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ecb_128_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "ECB 128 Encrypt VarKey 127",
    .p_plaintext        = "00000000000000000000000000000000",
    .p_ciphertext       = "a1f6258c877d5fcd8964484538bfc92c",
    .p_key              = "ffffffffffffffffffffffffffffffff"
};

// AES ECB - NIST CAVS 11.1 VarKey Tests 128 Decrypt - Count 0
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_ecb_128_decrypt_vk0) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ecb_128_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "ECB 128 Decrypt VarKey 0",
    .p_plaintext        = "00000000000000000000000000000000",
    .p_ciphertext       = "0edd33d3c621e546455bd8ba1418bec8",
    .p_key              = "80000000000000000000000000000000"
};

// AES ECB - NIST CAVS 11.1 VarKey Tests 128 Decrypt - Count 127
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_ecb_128_decrypt_vk127) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ecb_128_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "ECB 128 Decrypt VarKey 127",
    .p_plaintext        = "00000000000000000000000000000000",
    .p_ciphertext       = "a1f6258c877d5fcd8964484538bfc92c",
    .p_key              = "ffffffffffffffffffffffffffffffff"
};

// AES ECB - NIST CAVS 11.1 VarTxt Tests 128 Encrypt - Count 0
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_ecb_128_encrypt_vt0) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ecb_128_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "ECB 128 Encrypt VarTxt 0",
    .p_plaintext        = "80000000000000000000000000000000",
    .p_ciphertext       = "3ad78e726c1ec02b7ebfe92b23d9ec34",
    .p_key              = "00000000000000000000000000000000"
};

// AES ECB - NIST CAVS 11.1 VarTxt Tests 128 Encrypt - Count 127
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_ecb_128_encrypt_vt127) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ecb_128_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "ECB 128 Encrypt VarTxt 127",
    .p_plaintext        = "ffffffffffffffffffffffffffffffff",
    .p_ciphertext       = "3f5b8cc9ea855a0afa7347d23e8d664e",
    .p_key              = "00000000000000000000000000000000"
};

// AES ECB - NIST CAVS 11.1 VarTxt Tests 128 Decrypt - Count 0
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_ecb_128_decrypt_vt0) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ecb_128_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "ECB 128 Decrypt VarTxt 0",
    .p_plaintext        = "80000000000000000000000000000000",
    .p_ciphertext       = "3ad78e726c1ec02b7ebfe92b23d9ec34",
    .p_key              = "00000000000000000000000000000000"
};

// AES ECB - NIST CAVS 11.1 VarTxt Tests 128 Decrypt - Count 127
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_ecb_128_decrypt_vt127) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ecb_128_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "ECB 128 Decrypt VarTxt 127",
    .p_plaintext        = "ffffffffffffffffffffffffffffffff",
    .p_ciphertext       = "3f5b8cc9ea855a0afa7347d23e8d664e",
    .p_key              = "00000000000000000000000000000000"
};


// AES ECB - NIST CAVS 11.1 Multiblock Message Tests 128 Encrypt - Count 0
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_ecb_128_encrypt_16) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ecb_128_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "ECB 128 Encrypt message_len=16",
    .p_plaintext        = "1695fe475421cace3557daca01f445ff",
    .p_ciphertext       = "7888beae6e7a426332a7eaa2f808e637",
    .p_key              = "edfdb257cb37cdf182c5455b0c0efebb"
};

// AES ECB - NIST CAVS 11.1 Multiblock Message Tests 128 Encrypt - Count 1
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_ecb_128_encrypt_32) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ecb_128_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "ECB 128 Encrypt message_len=32",
    .p_plaintext        = "1b0a69b7bc534c16cecffae02cc5323190ceb413f1db3e9f0f79ba654c54b60e",
    .p_ciphertext       = "ad5b089515e7821087c61652dc477ab1f2cc6331a70dfc59c9ffb0c723c682f6",
    .p_key              = "7723d87d773a8bbfe1ae5b081235b566"
};

