trezor/trezor-firmware/core/embed/sdk/nrf52/examples/crypto/nrf_crypto/test_app/test_cases/test_vectors_aes_ecb.c
// AES ECB - NIST CAVS 11.1 GFSBox Tests 192 Decrypt - Count 0
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_ecb_192_decrypt_gfsb0) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ecb_192_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "ECB 192 Decrypt GFSBox 0",
    .p_plaintext        = "1b077a6af4b7f98229de786d7516b639",
    .p_ciphertext       = "275cfc0413d8ccb70513c3859b1d0f72",
    .p_key              = "000000000000000000000000000000000000000000000000"
};

// AES ECB - NIST CAVS 11.1 VarKey Tests 192 Encrypt - Count 0
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_ecb_192_encrypt_vk0) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ecb_192_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "ECB 192 Encrypt VarKey 0",
    .p_plaintext        = "00000000000000000000000000000000",
    .p_ciphertext       = "de885dc87f5a92594082d02cc1e1b42c",
    .p_key              = "800000000000000000000000000000000000000000000000"
};

// AES ECB - NIST CAVS 11.1 VarKey Tests 192 Encrypt - Count 191
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_ecb_192_encrypt_vk191) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ecb_192_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "ECB 192 Encrypt VarKey 191",
    .p_plaintext        = "00000000000000000000000000000000",
    .p_ciphertext       = "dd8a493514231cbf56eccee4c40889fb",
    .p_key              = "ffffffffffffffffffffffffffffffffffffffffffffffff"
};

// AES ECB - NIST CAVS 11.1 VarKey Tests 192 Decrypt - Count 0
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_ecb_192_decrypt_vk0) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ecb_192_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "ECB 192 Decrypt VarKey 0",
    .p_plaintext        = "00000000000000000000000000000000",
    .p_ciphertext       = "de885dc87f5a92594082d02cc1e1b42c",
    .p_key              = "800000000000000000000000000000000000000000000000"
};

// AES ECB - NIST CAVS 11.1 VarKey Tests 192 Decrypt - Count 191
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_ecb_192_decrypt_vk191) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ecb_192_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "ECB 192 Decrypt VarKey 191",
    .p_plaintext        = "00000000000000000000000000000000",
    .p_ciphertext       = "dd8a493514231cbf56eccee4c40889fb",
    .p_key              = "ffffffffffffffffffffffffffffffffffffffffffffffff"
};

// AES ECB - NIST CAVS 11.1 VarTxt Tests 192 Encrypt - Count 0
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_ecb_192_encrypt_vt0) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ecb_192_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "ECB 192 Encrypt VarTxt 0",
    .p_plaintext        = "80000000000000000000000000000000",
    .p_ciphertext       = "6cd02513e8d4dc986b4afe087a60bd0c",
    .p_key              = "000000000000000000000000000000000000000000000000"
};

// AES ECB - NIST CAVS 11.1 VarTxt Tests 192 Encrypt - Count 127
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_ecb_192_encrypt_vt127) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ecb_192_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "ECB 192 Encrypt VarTxt 127",
    .p_plaintext        = "ffffffffffffffffffffffffffffffff",
    .p_ciphertext       = "b13db4da1f718bc6904797c82bcf2d32",
    .p_key              = "000000000000000000000000000000000000000000000000"
};

// AES ECB - NIST CAVS 11.1 VarTxt Tests 192 Decrypt - Count 0
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_ecb_192_decrypt_vt0) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ecb_192_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "ECB 192 Decrypt VarTxt 0",
    .p_plaintext        = "80000000000000000000000000000000",
    .p_ciphertext       = "6cd02513e8d4dc986b4afe087a60bd0c",
    .p_key              = "000000000000000000000000000000000000000000000000"
};

// AES ECB - NIST CAVS 11.1 VarTxt Tests 192 Decrypt - Count 127
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_ecb_192_decrypt_vt127) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ecb_192_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "ECB 192 Decrypt VarTxt 127",
    .p_plaintext        = "ffffffffffffffffffffffffffffffff",
    .p_ciphertext       = "b13db4da1f718bc6904797c82bcf2d32",
    .p_key              = "000000000000000000000000000000000000000000000000"
};

// AES ECB - NIST CAVS 11.1 Multiblock Message Tests 192 Encrypt - Count 0
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_ecb_192_encrypt_16) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ecb_192_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "ECB 192 Encrypt message_len=16",
    .p_plaintext        = "60bcdb9416bac08d7fd0d780353740a5",
    .p_ciphertext       = "24f40c4eecd9c49825000fcb4972647a",
    .p_key              = "61396c530cc1749a5bab6fbcf906fe672d0c4ab201af4554"
};

// AES ECB - NIST CAVS 11.1 Multiblock Message Tests 192 Encrypt - Count 1
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_ecb_192_encrypt_32) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ecb_192_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "ECB 192 Encrypt message_len=32",
    .p_plaintext        = "64145e61e61cd96f796b187464fabbde6f42e693f501f1d73b3c606f00801506",
    .p_ciphertext       = "502a73e4051cfac8fe6343211a129f5a5f56710c41b32c84da978dda2cec34ad",
    .p_key              = "c9c86a51224e5f1916d3f33a602f697afc852a2c44d30d5f"
};

