trezor/trezor-firmware/core/embed/sdk/nrf52/examples/crypto/nrf_crypto/test_app/test_cases/test_vectors_aes_ecb.c
// AES ECB - NIST CAVS 11.1 Multiblock Message Tests 192 Encrypt - Count 2
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_ecb_192_encrypt_48) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ecb_192_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "ECB 192 Encrypt message_len=48",
    .p_plaintext        = "07d3781a71e87b8cf12cac4616f9c7a819be57a0770a7a66e0e6e469506826897c8530866f2715b8757f0f01389dc301",
    .p_ciphertext       = "0b0455954e477e87d1a338414f8ac4d760efb70e5770e5d496b31152cb07e9316378f7fd38c6903b31d4f1b1a53931af",
    .p_key              = "c4854919c324d381bbef9bea771172f6e4563ffbd1e1e956"
};

// AES ECB - NIST CAVS 11.1 Multiblock Message Tests 192 Encrypt - Count 3
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_ecb_192_encrypt_64) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ecb_192_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "ECB 192 Encrypt message_len=64",
    .p_plaintext        = "096612f4111ebdb9accf5efbb973589e5a2c9103407ed2da29bc7137a6c02de822df5907201d3dcbc49cb9a3955b2b86811d938422a6f5a23f2dffe4960fecab",
    .p_ciphertext       = "d375e1af5fcd03e31d0f735f6bc5d7e773bc34ff3eb706be85842f998e4e361303825b848170608f300ad1ced848b5233477f53710503c55736a730595599964",
    .p_key              = "3deecf7a037ebb2ada805e8059bfaeaebb195cace379fcd2"
};

// AES ECB - NIST CAVS 11.1 Multiblock Message Tests 192 Encrypt - Count 4
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_ecb_192_encrypt_80) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ecb_192_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "ECB 192 Encrypt message_len=80",
    .p_plaintext        = "6f825ad0e2fcabd811db11e2840f0884470b87eaa678e329342bf0d1125569c16dfa924049a51b497d594825ffca4f4062cd02359d0ead2b0e014264bf1bb313e741a06eb4813205470047520133cf91",
    .p_ciphertext       = "e6128a9fb497b2ec0d0e9fe1b24e691ea36c0628eb55046b2f20de9d281dd9dbbbeaa0519a4875d3516b15022330163b2798a9102ee9d141a3416c1a277442d4cf1fec87ccea571a23b91a461991ec0d",
    .p_key              = "0c0333d8fe3e99a1eecc120d6b54bb8faa888d12794de93e"
};

// AES ECB - NIST CAVS 11.1 Multiblock Message Tests 192 Encrypt - Count 5
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_ecb_192_encrypt_96) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ecb_192_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "ECB 192 Encrypt message_len=96",
    .p_plaintext        = "27756c11f57c40169f95f25141fb1a07d9444d864e4c43b9b16f39fbc2fb9529b6e4c9fb37ba7994add9e057bce070fd0d64b8e452e58baa84005ffb6fe7f3a7710f35f87f28624268526fbb5e8ea88db272972adf2227e0ca7b09ad48915754",
    .p_ciphertext       = "7516e53877236e931e7fbae22ed2ca5116b72a700f6e397c2aa47c304b3f5c2a026d89831a5104ae7b73ef48de709c1b9e661ae973dea6bb38217a7650228ccc6b228b33f567121427e9f21cbd3ec6aa35ebba336f51ed8e4bf6e75c5866bc20",
    .p_key              = "b07da99fbe0b193e5336141a9819974b1a9a4102129db861"
};

// AES ECB - NIST CAVS 11.1 Multiblock Message Tests 192 Encrypt - Count 6
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_ecb_192_encrypt_112) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ecb_192_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "ECB 192 Encrypt message_len=112",
    .p_plaintext        = "1e49e9541ed0f97023f8205e71fe75668680f12fb5902d7a11066d108c1adef960321cefaef8f71365b077de66c91e59e6b16c9113eea945fa6bdee3a80f25b38f9422512c97d260e7eb837d3b33247216b0bfac835744f08627884947b98d4573190460e0d410c170524d2437661118",
    .p_ciphertext       = "a47e7d0d8266595792bc980bf3c47822229e4428cc91aa1b15519823a133dd479a4664ec8408b4d9301760454ed2037279d996eb1ccc98df77660aa97422dca1c54d7bfac37223d0caee6a6b34d760e767b9595f7f3bb631d6545a7442d3497a7b85054e8b99d24e65df985e5bccf450",
    .p_key              = "80da652b1844dafe4fd4ca8ccc26b564b263711723b6cd48"
};

// AES ECB - NIST CAVS 11.1 Multiblock Message Tests 192 Encrypt - Count 7
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_ecb_192_encrypt_128) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ecb_192_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "ECB 192 Encrypt message_len=128",
    .p_plaintext        = "823fade2722805e4948db57639cbb67d477d4b01319d927826ec594789933486a20acc0393397a8a8ddd1564432e081e9fbfa78cb4a5c30cf5db7b0fa4e556d68db48f7af3cab02fcb9e62c928428480f7437af0ecd1c864bc1fdf538d0d362baa059d4e7c22cf5ab69846aecf50532ab5d26d35c068ca05e4802c1b2c53fe0c",
    .p_ciphertext       = "52c54ec4345e776b84952f5803ad3a52ba4cfedb32c2dc146ecc8813705f02fd3d4d559027e895e2ba29710396272436c398fa12ba02c85c02947df8035647334bc6c53e1d716f582206c8538f397784c3e42f535b68e8151b3cff71a82d2785b0eb298ff63aebc5d822549f44fbbcf0b69114323c9572d0bf674332fac3b57d",
    .p_key              = "9a35954f400034b29c9f85766a255cf1393dccb8d6c93e65"
};

// AES ECB - NIST CAVS 11.1 Multiblock Message Tests 192 Encrypt - Count 8
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_ecb_192_encrypt_144) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ecb_192_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "ECB 192 Encrypt message_len=144",
    .p_plaintext        = "f4d46d6ac9969cb6994c4f5f97a58634e5927e52bfaa82a2f7cc04a3a106ec6a0fb530e700eea569141d156483ec91730f670899375d19ccae0926b40bf1aab0c20fcc1a532f34ccc1981de246eeabc245577f5a80dd8aa98b141e8181fc4b8bf528688b2b20f0e58805906148737d2b6fab0b1e02f27c417634159269ed7803904a2dc3f18b82be52ab9567f143afb5",
    .p_ciphertext       = "a61376ae4c6f8fef51736087dd54ddc6cd917735386f73ff95884d92739d1af4a65386ad396fa01def9e3381133e2357506215519c2ebeffff12c35a70fb149d23f035d026ac1d24e5ec81f5c28684b4a203c29aaffc54794cabd3885090fc871cb8d4569190a39e3d34df87c3e05245ef7de4856d103e2a780361115f78e227622f93b7f9c2fd8390bfaf23a06cb348",
    .p_key              = "280a05e6ba0542e4e16dafe63d738fb4c544241b6626729a"
};

