trezor/trezor-firmware/core/embed/sdk/nrf52/examples/crypto/nrf_crypto/test_app/test_cases/test_vectors_aes_ecb.c
// AES ECB - NIST CAVS 11.1 Multiblock Message Tests 192 Encrypt - Count 9
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_ecb_192_encrypt_160) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ecb_192_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "ECB 192 Encrypt message_len=160",
    .p_plaintext        = "7c727bd3e7048e7a8995b7b1169ae4b5a55e854bb4f7a9576d7863ab2868731d307322dcca606e047343676f6af4d9cf6ebf2bf9c95d87848d233c931e7a60eff08fb959924cde1eec8699ebc57890e3887024ef47c89a550018788d1faa3250452e06f148af25f07bc613cd2f0e501a79d738d4361f28f34dbee24034e03367b6b8d34df3738ca3a86b9ebcb09e639bcb5e2f519f4a7a86fc7c41556404a95d",
    .p_ciphertext       = "922812ad5feacdf11fe7fdae96300149419e31cff54061b3c5ed27fdb8b50c9c0932b522a6c04e482499b011ef3c3e9dc56a1a61cfeb78b34032d26dbdc3cac51a3279bc934b9bce2d9c19bf858235613ba784e48e292d22c6b5a28e1d1bb860524fb7b5f9b3d9a5f4da66e340585bd2496fe6d6942db8d05d716fec03b17d19abb58b33332e24beaec7995d69525364fe139aa1fd62054668c58f23f1f94cfd",
    .p_key              = "4f41fa4d4a25100b586551828373bcca5540c68e9bf84562"
};


// AES ECB - NIST CAVS 11.1 Multiblock Message Tests 192 Decrypt - Count 0
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_ecb_192_decrypt_16) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ecb_192_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "ECB 192 Decrypt message_len=16",
    .p_plaintext        = "49aabe67da5322b6e11d63b78b5a0e15",
    .p_ciphertext       = "21c8229a4dceaf533fe4e96eced482a6",
    .p_key              = "f2d2b82280c2592ecfbcf500ae647078c9c57624cde9bf6c"
};

// AES ECB - NIST CAVS 11.1 Multiblock Message Tests 192 Decrypt - Count 1
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_ecb_192_decrypt_32) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ecb_192_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "ECB 192 Decrypt message_len=32",
    .p_plaintext        = "71b805feb56aaca22049073db10ad696751a4818b7005ae35eb3111cfeafcac8",
    .p_ciphertext       = "e741f38ed720877b53264ce81bdf2e5ea5b97163710ba29e9755cd3ba2caf091",
    .p_key              = "4bb83429faaaa25265f65c8ebb1caf815916810defe89281"
};

// AES ECB - NIST CAVS 11.1 Multiblock Message Tests 192 Decrypt - Count 2
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_ecb_192_decrypt_48) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ecb_192_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "ECB 192 Decrypt message_len=48",
    .p_plaintext        = "7991ecf8ec98c6da6a27ee89055783f7302f5cb063f9c67084850702dfc9d64834536ecf524dc10f8504c1b132101ce5",
    .p_ciphertext       = "d1568d45f495112f12e37461aacddbfda7a71d0a40dacb6c1d7e6e13bb2c0f72110dfd337437ca29b83a978698f5914e",
    .p_key              = "2ad0db3278b7f6afd75a0cb62b6132d36449010ef509a5b6"
};

// AES ECB - NIST CAVS 11.1 Multiblock Message Tests 192 Decrypt - Count 3
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_ecb_192_decrypt_64) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ecb_192_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "ECB 192 Decrypt message_len=64",
    .p_plaintext        = "9b540d3eb0bf52210aefe3b1929b3e43561c4110fb81520d41d671fc0f404dcddd879ef4a70f93311e6b034a6020e2b4fd5161748b57b61e7cbbd1d8e1d2cf42",
    .p_ciphertext       = "fd71fec985a92046a5c0b633112bb2cdde3581d98bf4323b417bdbc55a51384d21229602d8b5ef00001e5721d4359616174617b70f0a0198d2d6a3ddc013154f",
    .p_key              = "b7f4c377e6233c34717e7ac9040d369ac66c6d3f3b1e627d"
};

// AES ECB - NIST CAVS 11.1 Multiblock Message Tests 192 Decrypt - Count 4
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_ecb_192_decrypt_80) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ecb_192_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "ECB 192 Decrypt message_len=80",
    .p_plaintext        = "f7058804932feae0851aca9be500c54ec35b3552dbb1417d81de51b0b0f3209dc999302369f25b1f133dfdbd9fe50b6834273806ef525c61ec4f5e88714cb945b0fa6481ce75bbff50e8eece1527baa7",
    .p_ciphertext       = "e24ff85f7ae75226ddd393972c3f836a0fc4aa13f997b896ae01249b030f12c5e58a7a409d29879952063dd3d04f5fb7883e906bd74bb8468ba0a9e3a3cd037456bd545957e884f258cb71b1cd95d673",
    .p_key              = "f714e621c97768d82eea6bf98ebf4a82c005262188ff894a"
};

// AES ECB - NIST CAVS 11.1 Multiblock Message Tests 192 Decrypt - Count 5
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_ecb_192_decrypt_96) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ecb_192_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "ECB 192 Decrypt message_len=96",
    .p_plaintext        = "482466fe1bcbeb5ce8d21eb3b2c30997d36d4dd55f21e8271ad0b1b0cb12be86702eda3879db2838ee3a55fe9aef70c86118ac30b44030b7b53f8b21daba1a4c0137f58e1832aa8247809746e33da9a45ba6431d261546a9784c321be360d32e",
    .p_ciphertext       = "2a81ae3d397c7cd3b9746db43cc04b137261e5124c9158ed609e8d7590f903c1e68acf20c347e151390588f7b58e3947e1f38c04c82487ad3cbd1ff57423fc73fad07d9bc5ebfceda11c536cd89e9e520b96430261a3303ee4b6649a2724b130",
    .p_key              = "7c045f663d668e1f7ba80f06d0d25fefcb00b7808aaa3e95"
};

// AES ECB - NIST CAVS 11.1 Multiblock Message Tests 192 Decrypt - Count 6
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_ecb_192_decrypt_112) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ecb_192_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "ECB 192 Decrypt message_len=112",
    .p_plaintext        = "723e9a19c8526d312c75beef81c398dd3371594f98e7740ed9ffd65e347fde28cd677f58284930c6f45c61365103f24bc28034fb19f16549e0acbcaf141952e44df19e9256789a5054e8196eb4c52dad29a5e683cc668a78fa43526a0fc62c88229448098ef3d9bc237ff4f97a2e9491",
    .p_ciphertext       = "fe9a6e64dc5a5e485c96b854299ba3e6b958610780c325f1647825cf70a3f1c3cc21032dede2972b0992bd5cce78acea539e59c74f324836892ca28e8f31893aabb7a805136b0e9560cf3c3441287cd771977558e686fd074c452e61b1f5bc1f82a68573b6bc6a8e49975e65ec73bcb5",
    .p_key              = "0b4bd7be14e239620c8eb992a48ab50b3815849401d04e83"
};

// AES ECB - NIST CAVS 11.1 Multiblock Message Tests 192 Decrypt - Count 7
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_ecb_192_decrypt_128) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ecb_192_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "ECB 192 Decrypt message_len=128",
    .p_plaintext        = "34a8cbb7afab72a8e5753f04a5d18726f1f0a9a92e02f593d78d28c9dd50377af7bd4efa3eeb7b71ca7beb420161358088e2bdc295b65fcbe6097f7178a278b601a26102afd341f8c94f89b792ae421fcd458879704e9224f102b6ce204c55df73e15539d2fe04e8dc3e25e9e893994b5ae2705d65c01e0586ca4b18abf14f30",
    .p_ciphertext       = "557d3629e71ba544a20abaa2f314e77b844ac791609b5f6359a6a5a4a7cd3eebd18b8cacd107e86773e92c1ffe6c750e16b42797e163317c6967925141151c316c7c77af7af36a0ff4f556b7fa2f03e02bd69f91c53e04ce0da93a0df25d3de9edf9001a2b08b1a5eed73f5031841a598b583a67555662c10f14a6be00ca2b7d",
    .p_key              = "f5bd199c43e9917dfddf8464483ee605587d21ad907f5c7b"
};

