trezor/trezor-firmware/core/embed/sdk/nrf52/examples/crypto/nrf_crypto/test_app/test_cases/test_vectors_aes_ecb.c
// AES ECB - NIST CAVS 11.1 Multiblock Message Tests 192 Decrypt - Count 8
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_ecb_192_decrypt_144) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ecb_192_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "ECB 192 Decrypt message_len=144",
    .p_plaintext        = "d09b7aa92197e1a6a42d67a02091bc10f8b59cfea963d8ea279e8cd46b517508817aab5d4a7627ea39ad27b03a3b1c610f724bad22996d8249a4eab076e3091100da1aeb20698c00879b1f44549cc5209a0ee3a2f897355eed420cfa42a141944e904023bcd099dda51eb5444adbb30d920f887dc04362783c2fed4f336d5c0631acef029d95b545dcf9d0c40df2de6b",
    .p_ciphertext       = "c11a65accf2faa952d078713b6a73c7648fe4a4b0f1cd82d06a055deba6f5f9652ace39acce48611898844130ca15704ffbf5b207632af56787d1e5abc08bff6b01519a1bff58b52d47cec961ab26ee107cbc821985a9499dec1f5edb9ec7e79e43f4fe731cc810116cac5c3694247b5680cd978fcfa4d9e3f5322bf3b8364c8f510cd97aad030c5585a18c380baac29",
    .p_key              = "2f8118dd5b2ec401b9f501cf0149cb65ac451ed943e25e15"
};

// AES ECB - NIST CAVS 11.1 Multiblock Message Tests 192 Decrypt - Count 9
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_ecb_192_decrypt_160) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ecb_192_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "ECB 192 Decrypt message_len=160",
    .p_plaintext        = "b8bb5ce53a15aa6dfdf2cb61bc8e3617d1d0fefe9ba5d175550470e32397f6f3b3e65b43bded2b21e5c181d3c4c4c526c41ceab044289508458048b63352dfc379de373fd19a2c900c43524b75949e677cceda866f7f2bcc4844ef2e5dac5b804b4045e657c8156d1dcdb43cbf2f5e00a4f9255e3be2439436c4d0449a8d2c4c1a56bece98ea0fd68abaf12398039994aebffc692b9000e580479b4f4b28b5fe",
    .p_ciphertext       = "952f4546a8bf7166964917ece01bda3c6857e427cef5da0ff90b0e4bf44cf7ccfccfdf01d713dcf9673f01c87eaed52bf4aa046ff778558ea396dc9cd240716136386148a5c76378b3ffcd40864407b8e60b40a594e0619eddae3f6d6e3b15b86af231e1bae5ed2aa512e11da0e5572b67ffff934c36e585cfdd9f877045cb19c183b994bf74645862ffa726739aadcb9e10aaffc881c88ca3aa65b37f667bcb",
    .p_key              = "9cc24ea1f1959d9a972e7182ef3b4e22a97a87d0da7ff64b"
};



// AES ECB - NIST CAVS 11.1 Monte Carlo 192 Encrypt
NRF_SECTION_ITEM_REGISTER(test_vector_aes_monte_carlo_data, test_vector_aes_t test_vector_aes_ecb_192_encrypt_monte_carlo) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ecb_192_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "ECB Encrypt Monte Carlo 192",
    .p_plaintext        = "85a1f7a58167b389cddc8a9ff175ee26",
    .p_ciphertext       = "5d1196da8f184975e240949a25104554",
    .p_key              = "b9a63e09e1dfc42e93a90d9bad739e5967aef672eedd5da9"
};

// AES ECB - NIST CAVS 11.1 Monte Carlo 192 Decrypt
NRF_SECTION_ITEM_REGISTER(test_vector_aes_monte_carlo_data, test_vector_aes_t test_vector_aes_ecb_192_decrypt_monte_carlo) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ecb_192_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "ECB Decrypt Monte Carlo 192",
    .p_plaintext        = "b63ef1b79507a62eba3dafcec54a6328",
    .p_ciphertext       = "d0bd0e02ded155e4516be83f42d347a4",
    .p_key              = "4b97585701c03fbebdfa8555024f589f1482c58a00fdd9fd"
};

#endif // NRF_MODULE_ENABLED(NRF_CRYPTO_AES_ECB_192)

#if NRF_MODULE_ENABLED(NRF_CRYPTO_AES_ECB_256)

// AES ECB - Functional test using test vector NIST CAVS 11.1 ECB KeySbox 256 - Count 0
NRF_SECTION_ITEM_REGISTER(test_vector_aes_func_data, test_vector_aes_t test_vector_aes_ecb_256_functional) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ecb_256_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "ECB 256 Functional",
    .p_plaintext        = "00000000000000000000000000000000",
    .p_ciphertext       = "46f2fb342d6f0ab477476fc501242c5f",
    .p_key              = "c47b0294dbbbee0fec4757f22ffeee3587ca4730c3d33b691df38bab076bc558"
};

// AES ECB - Custom test vector - Encrypt - Message length 0
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_ecb_256_encrypt_c0) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ecb_256_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "ECB 256 Encrypt message_len=0",
    .p_plaintext        = "",
    .p_ciphertext       = "",
    .p_key              = "c9defba265de96a179a1128c2b5ef0edf6365c3064df88e2d46b2bfae20b599d"
};

// AES ECB - Custom test vector - Decrypt - Message length 0
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_ecb_256_decrypt_c0) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ecb_256_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "ECB 256 Decrypt message_len=0",
    .p_plaintext        = "",
    .p_ciphertext       = "",
    .p_key              = "c9defba265de96a179a1128c2b5ef0edf6365c3064df88e2d46b2bfae20b599d"
};

// AES ECB - Custom test vector - Encrypt - pkcs7-padding
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_ecb_256_encrypt_c3) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ecb_256_pad_pkcs7_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "ECB 256 Encrypt message_len=1 pkcs7-padding",
    .p_plaintext        = "de",
    .p_ciphertext       = "884506eb1952533a9020db23b501558b",
    .p_key              = "c9defba265de96a179a1128c2b5ef0edf6365c3064df88e2d46b2bfae20b599d"
};

// AES ECB - Custom test vector - Decrypt - pkcs7-padding
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_ecb_256_decrypt_c3) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ecb_256_pad_pkcs7_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "ECB 256 Decrypt message_len=1 pkcs7-padding",
    .p_plaintext        = "de0f0f0f0f0f0f0f0f0f0f0f0f0f0f0f",                                       /**< The 15 padded bytes (0x0f) will be removed in the actual generated plaintext. */
    .p_ciphertext       = "884506eb1952533a9020db23b501558b",
    .p_key              = "c9defba265de96a179a1128c2b5ef0edf6365c3064df88e2d46b2bfae20b599d"
};

// AES ECB - Custom test vector - Encrypt - pkcs7-padding
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_ecb_256_encrypt_c4) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ecb_256_pad_pkcs7_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "ECB 256 Encrypt message_len=16 pkcs7-padding",
    .p_plaintext        = "dededededededededededededededede",
    .p_ciphertext       = "758dbc3193a5d4edbe88d59d5488af319e10a9035476d946d238f0e5813f3678",
    .p_key              = "c9defba265de96a179a1128c2b5ef0edf6365c3064df88e2d46b2bfae20b599d"
};

// AES ECB - Custom test vector - Decrypt - pkcs7-padding
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_ecb_256_decrypt_c4) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ecb_256_pad_pkcs7_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "ECB 256 Decrypt message_len=16 pkcs7-padding",
    .p_plaintext        = "dededededededededededededededede10101010101010101010101010101010",       /**< The 16 padded bytes (0x10) will be removed in the actual generated plaintext. */
    .p_ciphertext       = "758dbc3193a5d4edbe88d59d5488af319e10a9035476d946d238f0e5813f3678",
    .p_key              = "c9defba265de96a179a1128c2b5ef0edf6365c3064df88e2d46b2bfae20b599d"
};

// AES ECB - Custom test vector - Encrypt - pkcs7-padding
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_ecb_256_encrypt_c5) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ecb_256_pad_pkcs7_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "ECB 256 Encrypt message_len=31 pkcs7-padding",
    .p_plaintext        = "dedededededededededededededededededededededededededededededede",
    .p_ciphertext       = "758dbc3193a5d4edbe88d59d5488af31946e8b4acfb239142704b12f8cd961a0",
    .p_key              = "c9defba265de96a179a1128c2b5ef0edf6365c3064df88e2d46b2bfae20b599d"
};

// AES ECB - Custom test vector - Decrypt - pkcs7-padding
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_ecb_256_decrypt_c5) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ecb_256_pad_pkcs7_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "ECB 256 Decrypt message_len=31 pkcs7-padding",
    .p_plaintext        = "dedededededededededededededededededededededededededededededede01",       /**< The padded byte (0x01) will be removed in the actual generated plaintext. */
    .p_ciphertext       = "758dbc3193a5d4edbe88d59d5488af31946e8b4acfb239142704b12f8cd961a0",
    .p_key              = "c9defba265de96a179a1128c2b5ef0edf6365c3064df88e2d46b2bfae20b599d"
};

